IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM5_CONTROLSS_G2_EPWM5.xml
	<register id="CONTROLSS_G2_EPWM5_TZCLR" acronym="CONTROLSS_G2_EPWM5_TZCLR" offset="0x12E" width="16" description="Trip Zone Clear Register">
		<bitfield id="CBCPULSE" width="2" begin="15" end="14" resetval="0x0" description="Clear Pulse for Cycle-By-Cycle [CBC] Trip Latch  This bit field determines which pulse clears the CBC trip latch.   00: CTR = zero pulse clears CBC trip latch. [Same as legacy designs.]  01: CTR = PRD pulse clears CBC trip latch.  10: CTR = zero or CTR = PRD pulse clears CBC trip latch.  11: CBC trip latch is not cleared" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="CAPEVT" width="1" begin="7" end="7" resetval="0x0" description="Clear Flag for Capture Event   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 clears the CAPEVT event trip condition." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT2" width="1" begin="6" end="6" resetval="0x0" description="Clear Flag for Digital Compare Output B Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 clears the DCBEVT2 event trip condition." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT1" width="1" begin="5" end="5" resetval="0x0" description="Clear Flag for Digital Compare Output B Event 1   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 clears the DCBEVT1 event trip condition." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT2" width="1" begin="4" end="4" resetval="0x0" description="Clear Flag for Digital Compare Output A Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 clears the DCAEVT2 event trip condition." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT1" width="1" begin="3" end="3" resetval="0x0" description="Clear Flag for Digital Compare Output A Event 1   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 clears the DCAEVT1 event trip condition." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Clear Flag for One-Shot Trip [OST] Latch   0: Has no effect. Always reads back a 0.  1: Clears this Trip [set] condition." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC] Trip Latch   0: Has no effect. Always reads back a 0.  1: Clears this Trip [set] condition." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Clear Flag   0: Has no effect. Always reads back a 0.  1: Clears the trip-interrupt flag for this ePWM module [TZFLG[INT]].  NOTE: No further EPWMx_TZINT PIE interrupts will be generated until the flag is cleared. If the TZFLG[INT] bit is cleared and any of the other flag bits are set, then another interrupt pulse will be generated. Clearing all flag bits will prevent further interrupts." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G2_EPWM5_TZCBCCLR" acronym="CONTROLSS_G2_EPWM5_TZCBCCLR" offset="0x130" width="16" description="Trip Zone CBC Clear Register">
		<bitfield id="CAPEVT" width="1" begin="8" end="8" resetval="0x0" description="Clear Flag for CAPEVT selected for CBC   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CAPEVT] bit." range="8" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT2" width="1" begin="7" end="7" resetval="0x0" description="Clear Flag for Digital Compare Output B Event 2 selected for CBC   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[DCBEVT2] bit." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT2" width="1" begin="6" end="6" resetval="0x0" description="Clear Flag for Digital Compare Output A Event 2 selected for CBC   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[DCAEVT2] bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="CBC6" width="1" begin="5" end="5" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC6] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC6] bit." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="CBC5" width="1" begin="4" end="4" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC5] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC5] bit." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="CBC4" width="1" begin="3" end="3" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC4] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC4] bit." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="CBC3" width="1" begin="2" end="2" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC3] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC3] bit." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="CBC2" width="1" begin="1" end="1" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC2] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC2] bit." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="CBC1" width="1" begin="0" end="0" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC1] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC1] bit." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G2_EPWM5_TZOSTCLR" acronym="CONTROLSS_G2_EPWM5_TZOSTCLR" offset="0x132" width="16" description="Trip Zone OST Clear Register">
		<bitfield id="CAPEVT" width="1" begin="8" end="8" resetval="0x0" description="Clear Flag for CAPEVT selected for OST   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[CAPEVT] bit." range="8" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT1" width="1" begin="7" end="7" resetval="0x0" description="Clear Flag for Digital Compare Output B Event 1 selected for OST   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[DCBEVT1] bit." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT1" width="1" begin="6" end="6" resetval="0x0" description="Clear Flag for Digital Compare Output A Event 1 selected for OST   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[DCAEVT1] bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="OST6" width="1" begin="5" end="5" resetval="0x0" description="Clear Flag for Oneshot [OST6] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST6] bit." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="OST5" width="1" begin="4" end="4" resetval="0x0" description="Clear Flag for Oneshot [OST5] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST5] bit." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="OST4" width="1" begin="3" end="3" resetval="0x0" description="Clear Flag for Oneshot [OST4] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST4] bit." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="OST3" width="1" begin="2" end="2" resetval="0x0" description="Clear Flag for Oneshot [OST3] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST3] bit." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="OST2" width="1" begin="1" end="1" resetval="0x0" description="Clear Flag for Oneshot [OST2] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST2] bit." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="OST1" width="1" begin="0" end="0" resetval="0x0" description="Clear Flag for Oneshot [OST1] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST1] bit." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G2_EPWM5_TZFRC" acronym="CONTROLSS_G2_EPWM5_TZFRC" offset="0x136" width="16" description="Trip Zone Force Register">
		<bitfield id="CAPEVT" width="1" begin="7" end="7" resetval="0x0" description="Force Flag for Capture Event Output   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the CAPEVT event trip condition and sets the TZFLG[CAPEVT] bit." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT2" width="1" begin="6" end="6" resetval="0x0" description="Force Flag for Digital Compare Output B Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCBEVT2 event trip condition and sets the TZFLG[DCBEVT2] bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT1" width="1" begin="5" end="5" resetval="0x0" description="Force Flag for Digital Compare Output B Event 1   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCBEVT1 event trip condition and sets the TZFLG[DCBEVT1] bit." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT2" width="1" begin="4" end="4" resetval="0x0" description="Force Flag for Digital Compare Output A Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCAEVT2 event trip condition and sets the TZFLG[DCAEVT2] bit." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT1" width="1" begin="3" end="3" resetval="0x0" description="Force Flag for Digital Compare Output A Event 1   0: Writing 0 has no effect. This bit always reads back 0  1: Writing 1 forces the DCAEVT1 event trip condition and sets the TZFLG[DCAEVT1] bit." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Force a One-Shot Trip Event via Software   0: Writing of 0 is ignored. Always reads back a 0.  1: Forces a one-shot trip event and sets the TZFLG[OST] bit." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Force a Cycle-by-Cycle Trip Event via Software   0: Writing of 0 is ignored. Always reads back a 0.  1: Forces a cycle-by-cycle trip event and sets the TZFLG[CBC] bit." range="1" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G2_EPWM5_TZTRIPOUTSEL" acronym="CONTROLSS_G2_EPWM5_TZTRIPOUTSEL" offset="0x13A" width="16" description="Trip Zone Force Register">
		<bitfield id="CAPEVT" width="1" begin="12" end="12" resetval="0x0" description="CAPEVT Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="12" rwaccess="R/W"/> 
		<bitfield id="DCBEVT2" width="1" begin="11" end="11" resetval="0x0" description="DCBEVT2 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="11" rwaccess="R/W"/> 
		<bitfield id="DCBEVT1" width="1" begin="10" end="10" resetval="0x0" description="DCBEVT1 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="10" rwaccess="R/W"/> 
		<bitfield id="DCAEVT2" width="1" begin="9" end="9" resetval="0x0" description="DCAEVT2 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="9" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1" width="1" begin="8" end="8" resetval="0x0" description="DCAEVT1 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="8" rwaccess="R/W"/> 
		<bitfield id="TZ6" width="1" begin="7" end="7" resetval="0x0" description="Trip-zone 6 [TZ6] Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="7" rwaccess="R/W"/> 
		<bitfield id="TZ5" width="1" begin="6" end="6" resetval="0x0" description="Trip-zone 5 [TZ5] Select   0: Disable TZ5 as a TRIPOUT source for this ePWM module  1: Enable TZ5 as a TRIPOUT source for this ePWM module" range="6" rwaccess="R/W"/> 
		<bitfield id="TZ4" width="1" begin="5" end="5" resetval="0x0" description="Trip-zone 4 [TZ4] Select   0: Disable TZ4 as a TRIPOUT source for this ePWM module  1: Enable TZ4 as a TRIPOUT source for this ePWM module" range="5" rwaccess="R/W"/> 
		<bitfield id="TZ3" width="1" begin="4" end="4" resetval="0x0" description="Trip-zone 3 [TZ3] Select   0: Disable TZ3 as a TRIPOUT source for this ePWM module  1: Enable TZ3 as a TRIPOUT source for this ePWM module" range="4" rwaccess="R/W"/> 
		<bitfield id="TZ2" width="1" begin="3" end="3" resetval="0x0" description="Trip-zone 2 [TZ2] Select   0: Disable TZ2 as a TRIPOUT source for this ePWM module  1: Enable TZ2 as a TRIPOUT source for this ePWM module" range="3" rwaccess="R/W"/> 
		<bitfield id="TZ1" width="1" begin="2" end="2" resetval="0x0" description="Trip-zone 1 [TZ1] Select   0: Disable TZ1 as a TRIPOUT source for this ePWM module  1: Enable TZ1 as a TRIPOUT source for this ePWM module" range="2" rwaccess="R/W"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="CBC  Select   0: Disable TZ1 as a TRIPOUT source for this ePWM module  1: Enable TZ1 as a TRIPOUT source for this ePWM module" range="1" rwaccess="R/W"/> 
		<bitfield id="OST" width="1" begin="0" end="0" resetval="0x0" description="OST Select   0: Disable TZ1 as a TRIPOUT source for this ePWM module  1: Enable TZ1 as a TRIPOUT source for this ePWM module" range="0" rwaccess="R/W"/>
	</register>
